tap 'aws/tap'
tap 'buo/cask-upgrade'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
brew 'ansible'
brew 'ansible-lint'
brew 'argocd'
brew 'awscli'
brew 'bat'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'docker'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'git-quick-stats'
brew 'goenv'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'go'
brew 'gopls'
brew 'grep'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'hugo'
brew 'istioctl'
brew 'jid'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kustomize'
brew 'libvirt', restart_service: true
brew 'lesspipe'
brew 'mas'
brew 'minikube'
brew 'moreutils'
brew 'mtr'
brew 'neovim'
brew 'nmap'
brew 'node'
brew 'nodenv'
brew 'p7zip'
brew 'packer'
brew 'pbzip2'
brew 'pigz'
brew 'pipenv'
brew 'pipx'
brew 'podman'
brew 'pre-commit'
brew 'proselint'
brew 'pyenv'
brew 'python'
brew 'python-yq'
brew 'shellcheck'
brew 'sops'
brew 'ssh-copy-id'
brew 'terraform'
brew 'terragrunt'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'tree-sitter'
brew 'virtualenv'
brew 'watch'
brew 'wget'
brew 'yamllint'
brew 'yarn'
cask 'alacritty'
cask 'alfred'
cask 'bartender'
cask 'bitwarden'
cask 'dbeaver-community'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'vagrant'
cask 'visual-studio-code'
mas "Yubico Authenticator", id: 1497506650
