tap "aws/tap"
tap "azure/functions"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
brew "ansible"
brew "ansible-lint"
brew "apr-util"
brew "argocd"
brew "automake"
brew "aws-shell"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bat"
brew "black"
brew "brew-gem"
brew "bzip2"
brew "cfssl"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "fd"
brew "flake8"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "glib"
brew "gnu-sed"
brew "gnu-tar"
brew "gnutls"
brew "gnupg"
brew "go"
brew "grc"
brew "grep"
brew "helm"
brew "htop"
brew "httpie"
brew "httpstat"
brew "istioctl"
brew "jid"
brew "jmeter"
brew "jq"
brew "kubectx"
brew "kustomize"
brew "lesspipe"
brew "mas"
brew "media-info"
brew "midnight-commander"
brew "minikube"
brew "mitmproxy"
brew "moreutils"
brew "mtr"
brew "nmap"
brew "p7zip"
brew "packer"
brew "pbzip2"
brew "perl"
brew "pigz"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "pre-commit"
brew "proselint"
brew "pv"
brew "pyenv"
brew "python-yq"
brew "ranger"
brew "ruby"
brew "shellcheck"
brew "spark"
brew "ssh-copy-id"
brew "sshfs"
brew "sshuttle"
brew "terraform"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "virtualenv"
brew "watch"
brew "wget"
brew "yamllint"
brew "zlib"
brew "zsh"
cask "adoptopenjdk"
cask "apache-directory-studio"
cask "dash"
cask "dbeaver-community"
cask "google-cloud-sdk"
cask "karabiner-elements"
cask "osxfuse"
cask "rectangle"
cask "signal"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Yubico Authenticator", id: 1497506650
