tap 'aws/tap'
tap 'buo/cask-upgrade'
tap 'homebrew/services'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'universal-ctags/universal-ctags'
brew 'ansible'
brew 'ansible-lint'
brew 'automake'
brew 'aws-shell'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'colordiff'
brew 'coreutils'
brew 'curl'
brew 'diff-so-fancy'
brew 'fd'
brew 'flake8'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'git-quick-stats'
brew 'goenv'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'go'
brew 'gopls'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'jid'
brew 'jq'
brew 'lesspipe'
brew 'mas'
brew 'mitmproxy'
brew 'moreutils'
brew 'mtr'
brew 'nmap'
brew 'nodenv'
brew 'p7zip'
brew 'packer'
brew 'pbzip2'
brew 'pigz'
brew 'pipx'
brew 'pre-commit'
brew 'proselint'
brew 'pyenv'
brew 'python'
brew 'python-yq'
brew 'ranger'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yamllint'
cask 'alfred'
cask 'bartender'
cask 'bitwarden'
cask 'discord'
cask 'dash'
cask 'dbeaver-community'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'postman'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'webex-meetings'
cask 'zoom'
mas "Yubico Authenticator", id: 1497506650
