cask 'electrum'
cask 'google-chrome'
cask 'monero-wallet'
cask 'mullvad-browser'
cask 'knockknock'
cask 'little-snitch'
cask 'linphone'
cask 'taskexplorer'
cask 'thunderbird'
cask 'transmission'
cask 'signal'
cask 'slack'
cask 'taskexplorer'
cask 'tor-browser'
brew 'mas'
mas 'WireGuard', id: 1451685025