tap "aws/tap"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "automake"
brew "aws-shell"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "fd"
brew "flyctl"
brew "fzf"
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "goenv"
brew "gopls"
brew "grep"
brew "hopenpgp-tools"
brew "htop"
brew "httpie"
brew "httpstat"
brew "jid"
brew "jq"
brew "lesspipe"
brew "lua-language-server"
brew "mas"
brew "moreutils"
brew "mtr"
brew "neovim"
brew "nmap"
brew "nodenv"
brew "openssh"
brew "p7zip"
brew "pbzip2"
brew "pigz"
brew "pinentry-mac"
brew "pipenv"
brew "pipx"
brew "virtualenv"
brew "pre-commit"
brew "proselint"
brew "pyenv"
brew "python-yq"
brew "python@3.10"
brew "shellcheck"
brew "ssh-copy-id"
brew "terraform"
brew "terragrunt"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "yamllint"
brew "ykman"
brew "ykpers"
cask "alacritty"
cask "alfred"
cask "bartender"
cask "bitwarden"
cask "electrum"
cask "eloston-chromium"
cask "firefox"
cask "little-snitch"
cask "monero-wallet"
cask "rectangle"
cask "signal"
cask "slack"
cask "sublime-text"
cask "taskexplorer"
cask "tor-browser"
cask "transmission"
mas "SimpleLogin", id: 1494051017
mas "Yubico Authenticator", id: 1497506650
