brew 'act' # Run GitHub Actions workflows locally
brew 'actionlint' # Lint GitHub Actions workflow files
brew 'bat' # Better cat
brew 'coreutils'
brew 'curl'
brew 'curlie'
brew 'direnv' # Loading .envrc files
brew 'doggo' # Better dig
brew 'dua-cli' # Better du
brew 'eza' # Better ls
brew 'fd' # better find
brew 'fzf' # Fuzzy finder
brew 'gh' # GitHub CLI (issues, PRs, releases)
brew 'git' # More recent version of git
brew 'git-delta' # Better diff
brew 'git-cliff' # Changelog from conventional commits
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go' # Go toolchain — gopls/gofumpt/goimports (nvim) need `go` on PATH
brew 'grep' # aliased to rg interactively, but scripts/subprocesses call grep directly
brew 'htop'
brew 'hyperfine' # Command-line benchmarking
brew 'jaq' # Fast jq alternative
brew 'lefthook' # Manages the git hooks in lefthook.yml
brew 'lesspipe'
brew 'neovim'
brew 'node' # pyright/bash-language-server (nvim) are npm packages
brew 'powerlevel10k' # zsh command prompt
brew 'python' # Apple's bundled python3 is ancient (3.9) and not dev-grade
brew 'ripgrep' # Faster ag written in Rust
brew 'shellcheck' # Lint shell scripts
brew 'tealdeer' # tldr utility
brew 'zellij' # terminal multiplexer
brew 'zoxide' # Smart cd
brew 'zsh-completions'
brew 'zsh-autopair'
brew 'zsh-autosuggestions'

cask 'claude' # AI desktop app
cask 'claude-code' # AI coding assistant CLI
cask 'font-jetbrains-mono-nerd-font'
cask 'ghostty' # GPU-accelerated terminal
cask 'rectangle'

# Personal
cask 'bitwarden'
cask 'mullvad-vpn'
cask 'steam'
cask 'transmission'
cask 'vscodium'
