tap 'Giammarco-Ferranti/deja' # deja isn't in homebrew-core
tap 'michel-kraemer/zsh-patina' # zsh-patina isn't in homebrew-core

brew 'act' # Run GitHub Actions workflows locally
brew 'actionlint' # Lint GitHub Actions workflow files
brew 'adr-tools' # Create/manage Architecture Decision Records (docs/adr/)
brew 'bat' # Better cat
brew 'colima' # On-demand Docker runtime (Lima VM) for `act`
brew 'coreutils'
brew 'curl'
brew 'curlie'
brew 'deja' # Fuzzy/directory/sequence-aware autosuggestions, replaces zsh-autosuggestions
brew 'direnv' # Loading .envrc files
brew 'docker' # Docker CLI — talks to Colima's socket, no Docker Desktop
brew 'doggo' # Better dig
brew 'dua-cli' # Better du
brew 'dysk' # Better df
brew 'eza' # Better ls
brew 'fd' # better find
brew 'fzf' # Fuzzy finder
brew 'gh' # GitHub CLI (issues, PRs, releases)
brew 'git' # More recent version of git
brew 'git-delta' # Better diff
brew 'git-cliff' # Changelog from conventional commits
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go' # Go toolchain — gopls/gofumpt/goimports (nvim) need `go` on PATH
brew 'grep' # aliased to rg interactively, but scripts/subprocesses call grep directly
brew 'htop'
brew 'hyperfine' # Command-line benchmarking
brew 'jaq' # Fast jq alternative
brew 'just' # Task runner (justfile) for repo dev verbs — see ADR-0019
brew 'lefthook' # Manages the git hooks in lefthook.yml
brew 'lesspipe'
brew 'markdownlint-cli2' # Lint Markdown files
brew 'neovim'
brew 'node' # pyright/bash-language-server (nvim) are npm packages
brew 'powerlevel10k' # zsh command prompt
brew 'prettier' # Format Markdown files
brew 'procs' # Better ps
brew 'python' # Apple's bundled python3 is ancient (3.9) and not dev-grade
brew 'ripgrep' # Faster ag written in Rust
brew 'selene' # Lint Lua files
brew 'shellcheck' # Lint shell scripts
brew 'shfmt' # Format shell scripts
brew 'stylua' # Format Lua files
brew 'taplo' # Lint and format TOML files
brew 'tealdeer' # tldr utility
brew 'uv' # Python package/env manager for project scaffolding
brew 'viddy' # Better watch
brew 'yamlfmt' # Format YAML files
brew 'zellij' # terminal multiplexer
brew 'zoxide' # Smart cd
brew 'zsh-completions'
brew 'zsh-autopair'
brew 'zsh-patina' # Better syntax highlighting than fast-syntax-highlighting
brew 'zsh-you-should-use' # Reminds you when a typed command has a shorter alias

cask 'claude' # AI desktop app
cask 'claude-code' # AI coding assistant CLI
cask 'font-jetbrains-mono-nerd-font'
cask 'ghostty' # GPU-accelerated terminal
cask 'rectangle'

# Personal
cask 'bitwarden'
cask 'mullvad-vpn'
cask 'steam'
cask 'transmission'
cask 'vscodium'
