<<<<<<< HEAD
tap 'homebrew/cask-fonts'
tap 'olets/tap'
tap 'romkatv/powerlevel10k'

brew 'bat'
brew 'bat-extras' # batgrep, batpipe
brew 'coreutils'
brew 'curl'
brew 'curlie'
brew 'direnv'
brew 'dog'
brew 'dua-cli'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'goenv'
brew 'grc'
brew 'grep'
brew 'htop'
brew 'httpstat'
brew 'lesspipe'
brew 'neovim'
brew 'openssh'
brew 'powerlevel10k'
brew 'pyenv'
brew 'ripgrep'
brew 'tealdeer'
brew 'tmux'
brew 'tree'
brew 'viddy'
brew 'wget'
brew 'zoxide'
brew 'zsh-completions'
brew 'zsh-fast-syntax-highlighting'
brew 'zsh-abbr'
brew 'zsh-autopair'
brew 'zsh-autosuggestions'

cask 'alacritty'
cask 'bitwarden'
cask 'firefox'
cask 'google-chrome'
cask 'font-hack-nerd-font'
cask 'postman'
cask 'rectangle'
cask 'sublime-text'
||||||| (empty tree)
=======
tap 'homebrew/cask-fonts'
tap 'olets/tap'
tap 'romkatv/powerlevel10k'

brew 'bat'
brew 'bat-extras' # batgrep, batpipe
brew 'coreutils'
brew 'curl'
brew 'curlie'
brew 'direnv'
brew 'dog'
brew 'dua-cli'
brew 'exa'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-delta'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'goenv'
brew 'grc'
brew 'grep'
brew 'htop'
brew 'httpstat'
brew 'neovim'
brew 'nodenv'
brew 'node-build'
brew 'openssh'
brew 'powerlevel10k'
brew 'pyenv'
brew 'ripgrep'
brew 'tealdeer'
brew 'tmux'
brew 'tree'
brew 'viddy'
brew 'wget'
brew 'zoxide'
brew 'zsh-completions'
brew 'zsh-fast-syntax-highlighting'
brew 'zsh-abbr'
brew 'zsh-autopair'
brew 'zsh-autosuggestions'

cask 'alacritty'
cask 'bitwarden'
cask 'firefox'
cask 'google-chrome'
cask 'font-hack-nerd-font'
cask 'postman'
cask 'rectangle'
cask 'sublime-text'
>>>>>>> 4b543a15 (moved stuff)
